app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The Newest Article"], ["body", "Content for this article."], ["created_at", "2020-04-03 19:38:19.612817"], ["updated_at", "2020-04-03 19:38:19.612817"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_article
      @article = Article.find(params[:id])